
# Pandas

Consist of two datatypes named as series (used to hold single dimentional data) and dataframe (used to hold data of more than 1 dimention)

# Series

In [1]:
import pandas as pd

In [3]:
data = [1, 2, 3, 4, 5, 6, 7, 8, 9]
s1 = pd.Series(data)
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [4]:
type(s1)

pandas.core.series.Series

In [5]:
s1.values

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [6]:
s1.index

RangeIndex(start=0, stop=9, step=1)

In [7]:
data = [1, 2, 3, 4, 5]
s2 = pd.Series(data)
s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
s2.index = ['a', 'b', 'c', 'd', 'e']
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
s1[0]

1

In [12]:
s2['a']

1

In [13]:
s2.iloc[2]   # ilock using positional index

3

In [15]:
s2['c'] = 5
s2

a    1
b    2
c    5
d    4
e    5
dtype: int64

In [16]:
s2.loc['f'] = 88  # loc using index labels
s2

a     1
b     2
c     5
d     4
e     5
f    88
dtype: int64

In [17]:
'c' in s2.index

True

In [19]:
s2[1:4]

b    2
c    5
d    4
dtype: int64

In [21]:
data = {'Jaipur': 'Rajasthan', 'Mumbai': 'Maharashtra',
       'Kolkata': 'West Bengal', 'Bengaluru': 'Karnataka',
       'Chandigarh': 'punjab'}
s2 = pd.Series(data)
s2

Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Bengaluru       Karnataka
Chandigarh         punjab
dtype: object

In [22]:
s2.name = 'Capitals and States'
s2.index.name = 'Capitals'
s2

Capitals
Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Bengaluru       Karnataka
Chandigarh         punjab
Name: Capitals and States, dtype: object

In [23]:
s2[['Jaipur', 'Kolkata', 'Mumbai']]   # if you use [[]] then it will be returing series

Capitals
Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Name: Capitals and States, dtype: object

In [26]:
capitals = ['Jaipur', 'Kolkata', 'Mumbai', 'Delhi']
s3 = pd.Series(s2, index = capitals)   # it will extract values matching to passed index i.e., capitals
s3

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Delhi              NaN
Name: Capitals and States, dtype: object

In [27]:
s3.isnull()

Jaipur     False
Kolkata    False
Mumbai     False
Delhi       True
Name: Capitals and States, dtype: bool

In [28]:
s3.notnull()

Jaipur      True
Kolkata     True
Mumbai      True
Delhi      False
Name: Capitals and States, dtype: bool

In [29]:
s3.duplicated()

Jaipur     False
Kolkata    False
Mumbai     False
Delhi      False
Name: Capitals and States, dtype: bool

In [30]:
s3.duplicated().sum()

0

In [31]:
s2 = pd.Series(['India', 'Australia', 'England'], index = ['Cricket', 'Cricket', 'Cricket'])
s2

Cricket        India
Cricket    Australia
Cricket      England
dtype: object

# DataFrame

In [32]:
student1 = pd.Series({'Name': 'Diptesh', 'ID': 1})
student2 = pd.Series({'Name': 'Pranav', 'ID': 2})
student3 = pd.Series({'Name': 'Yashraj', 'ID': 3})

In [33]:
df1 = pd.DataFrame([student1, student2, student3], index = [101, 102, 103])
df1

        Name  ID
101  Diptesh   1
102   Pranav   2
103  Yashraj   3

In [34]:
data = {'Name': ['Diptesh', 'Pranav', 'Yashraj'], 'ID': [1, 2, 3]}
df2 = pd.DataFrame(data, index=[101,102,103])
df2

        Name  ID
101  Diptesh   1
102   Pranav   2
103  Yashraj   3

In [36]:
df3 = pd.DataFrame(data = data, index = [101, 102, 103], columns = ['Name', 'ID', 'Age'])
df3

        Name  ID  Age
101  Diptesh   1  NaN
102   Pranav   2  NaN
103  Yashraj   3  NaN

In [37]:
df3.index

Int64Index([101, 102, 103], dtype='int64')

In [38]:
df3.values

array([['Diptesh', 1, nan],
       ['Pranav', 2, nan],
       ['Yashraj', 3, nan]], dtype=object)

In [39]:
df3.columns

Index(['Name', 'ID', 'Age'], dtype='object')

In [40]:
df3.Age = [20, 18, 35]

In [41]:
df3

        Name  ID  Age
101  Diptesh   1   20
102   Pranav   2   18
103  Yashraj   3   35

In [42]:
df3.Age

101    20
102    18
103    35
Name: Age, dtype: int64

In [43]:
df3.Name

101    Diptesh
102     Pranav
103    Yashraj
Name: Name, dtype: object

In [44]:
df3.ID

101    1
102    2
103    3
Name: ID, dtype: int64

In [45]:
df3.iloc[0]

Name    Diptesh
ID            1
Age          20
Name: 101, dtype: object

In [46]:
df3.loc[101]

Name    Diptesh
ID            1
Age          20
Name: 101, dtype: object

In [47]:
df3.loc[104] = ['Shrikrushnakumar', 4, 80]
df3

                 Name  ID  Age
101           Diptesh   1   20
102            Pranav   2   18
103           Yashraj   3   35
104  Shrikrushnakumar   4   80

In [48]:
df3[['Age', 'Name']]

     Age              Name
101   20           Diptesh
102   18            Pranav
103   35           Yashraj
104   80  Shrikrushnakumar

In [49]:
df3[1:3]

        Name  ID  Age
102   Pranav   2   18
103  Yashraj   3   35

In [52]:
df3.loc[101]['Name']   # loc can't be used for assigning purpose

'Diptesh'

In [54]:
df3

                 Name  ID  Age
101           Diptesh   1   20
102            Pranav   2   18
103           Yashraj   3   35
104  Shrikrushnakumar   4   80

In [55]:
df3['Name'][102]

'Pranav'

In [56]:
df3['Age'][104]

80

In [57]:
df3.loc[101, ['Name', 'Age']]

Name    Diptesh
Age          20
Name: 101, dtype: object

In [59]:
df3.loc[[102, 103], ['Name', 'Age']]

        Name  Age
102   Pranav   18
103  Yashraj   35

In [60]:
df3.iloc[2]['Name']

'Yashraj'

In [62]:
df3.iloc[2][['Name', 'Age']]

Name    Yashraj
Age          35
Name: 103, dtype: object

In [64]:
df3['Name']

101             Diptesh
102              Pranav
103             Yashraj
104    Shrikrushnakumar
Name: Name, dtype: object

In [65]:
df3.iloc[0]  # each row is series

Name    Diptesh
ID            1
Age          20
Name: 101, dtype: object

In [66]:
df3.Name

101             Diptesh
102              Pranav
103             Yashraj
104    Shrikrushnakumar
Name: Name, dtype: object

In [67]:
type(df3.Name)

pandas.core.series.Series

In [68]:
df3.loc[:, ['Name', 'Age']]

                 Name  Age
101           Diptesh   20
102            Pranav   18
103           Yashraj   35
104  Shrikrushnakumar   80

In [69]:
df3.loc[102:104, ['Name', 'Age']]

                 Name  Age
102            Pranav   18
103           Yashraj   35
104  Shrikrushnakumar   80

In [71]:
df3.head(2)

        Name  ID  Age
101  Diptesh   1   20
102   Pranav   2   18

In [72]:
df3.tail(2)

                 Name  ID  Age
103           Yashraj   3   35
104  Shrikrushnakumar   4   80

In [73]:
df3.isnull().sum()

Name    0
ID      0
Age     0
dtype: int64

In [74]:
df3.duplicated().sum()

0

In [76]:
df3.sort_index(ascending = False)

                 Name  ID  Age
104  Shrikrushnakumar   4   80
103           Yashraj   3   35
102            Pranav   2   18
101           Diptesh   1   20

In [77]:
df3.sort_values(by = 'Age')

                 Name  ID  Age
102            Pranav   2   18
101           Diptesh   1   20
103           Yashraj   3   35
104  Shrikrushnakumar   4   80

In [78]:
df3['Name'].unique()

array(['Diptesh', 'Pranav', 'Yashraj', 'Shrikrushnakumar'], dtype=object)

In [79]:
df3['Name'].nunique()

4

In [80]:
df3.dropna()  # to drop null values

                 Name  ID  Age
101           Diptesh   1   20
102            Pranav   2   18
103           Yashraj   3   35
104  Shrikrushnakumar   4   80

In [81]:
df3.fillna('Value')  # to fill null values

                 Name  ID  Age
101           Diptesh   1   20
102            Pranav   2   18
103           Yashraj   3   35
104  Shrikrushnakumar   4   80

In [99]:
df3[df3.Age != 80]["Name"]

101    Diptesh
102     Pranav
103    Yashraj
Name: Name, dtype: object

In [101]:
df3.query('Age > 25')

                 Name  ID  Age
103           Yashraj   3   35
104  Shrikrushnakumar   4   80

In [102]:
pd.concat([df3, df3])

                 Name  ID  Age
101           Diptesh   1   20
102            Pranav   2   18
103           Yashraj   3   35
104  Shrikrushnakumar   4   80
101           Diptesh   1   20
102            Pranav   2   18
103           Yashraj   3   35
104  Shrikrushnakumar   4   80

In [103]:
pd.concat([df3, df3], axis = 1)

                 Name  ID  Age              Name  ID  Age
101           Diptesh   1   20           Diptesh   1   20
102            Pranav   2   18            Pranav   2   18
103           Yashraj   3   35           Yashraj   3   35
104  Shrikrushnakumar   4   80  Shrikrushnakumar   4   80

In [92]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 101 to 104
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   ID      4 non-null      int64
 2   Age     4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [82]:
import numpy as np
data = {'A' : np.arange(11,21),
        'B' : np.arange(21,31),
        'C' : np.arange(31,41)}
df = pd.DataFrame(data)
df

    A   B   C
0  11  21  31
1  12  22  32
2  13  23  33
3  14  24  34
4  15  25  35
5  16  26  36
6  17  27  37
7  18  28  38
8  19  29  39
9  20  30  40

In [83]:
df.sum()  # default axis = 0 i.e. along column

A    155
B    255
C    355
dtype: int64

In [84]:
df.sum(axis = 1)

0    63
1    66
2    69
3    72
4    75
5    78
6    81
7    84
8    87
9    90
dtype: int64

In [85]:
df.mean(axis = 1)

0    21.0
1    22.0
2    23.0
3    24.0
4    25.0
5    26.0
6    27.0
7    28.0
8    29.0
9    30.0
dtype: float64

In [86]:
df.min()

A    11
B    21
C    31
dtype: int32

In [87]:
df.max()

A    20
B    30
C    40
dtype: int32

In [88]:
df.var()

A    9.166667
B    9.166667
C    9.166667
dtype: float64

In [89]:
df.std()

A    3.02765
B    3.02765
C    3.02765
dtype: float64

In [90]:
df.median()

A    15.5
B    25.5
C    35.5
dtype: float64

In [91]:
df.describe()

              A         B         C
count  10.00000  10.00000  10.00000
mean   15.50000  25.50000  35.50000
std     3.02765   3.02765   3.02765
min    11.00000  21.00000  31.00000
25%    13.25000  23.25000  33.25000
50%    15.50000  25.50000  35.50000
75%    17.75000  27.75000  37.75000
max    20.00000  30.00000  40.00000

In [93]:
df.corr()

     A    B    C
A  1.0  1.0  1.0
B  1.0  1.0  1.0
C  1.0  1.0  1.0

In [104]:
df

    A   B   C
0  11  21  31
1  12  22  32
2  13  23  33
3  14  24  34
4  15  25  35
5  16  26  36
6  17  27  37
7  18  28  38
8  19  29  39
9  20  30  40